// Напишите программу, которая принимает на вход трёхзначное число 
// и на выходе показывает вторую цифру этого числа

Console.WriteLine ("Программа вывода второй цифры трехзначного числа");
Console.WriteLine ("Введите трехзначное число: ");

string? number = Console.ReadLine ();

Console.WriteLine(number[1]);